{
  "basics": {
    "name": "Daksh Maheshwari",
    "label": "",
    "image": "",
    "email": "daksh@umich.edu",
    "phone": "(734) 596-4609",
    "url": "",
    "summary": "",
    "location": {
      "address": "1753 McIntyre Drive",
      "postalCode": "MI 48105",
      "city": "Ann Arbor",
      "countryCode": "US",
      "region": "Michigan"
    },
    "profiles": [
      {
        "network": "LinkedIn",
        "username": "daksh-maheshwari",
        "url": "https://www.linkedin.com/in/daksh-maheshwari"
      }
    ]
  },
  "education": [
    {
      "institution": "University of Michigan, Ann Arbor",
      "location": "Ann Arbor, Michigan",
      "url": "https://ece.engin.umich.edu/",
      "area": "Electrical and Computer Engineering",
      "specialization": "Signal Processing and Image Processing & Machine Learning",
      "transcript": "daksh-UMich-transcript.pdf",
      "studyType": "Master of Science",
      "startDate": "2022-08-01",
      "endDate": "2024-04-01",
      "score": "3.81/4.0",
      "courses": []
    },
    {
      "institution": "Birla Institute of Technology and Science, Pilani",
      "location": "Hydrabad, India",
      "url": "https://www.bits-pilani.ac.in/",
      "area": "Electronics and Instrumentation Engineering",
      "studyType": "Bachelor of Engineering",
      "startDate": "2016-07-01",
      "endDate": "2020-05-01",
      "score": "8.1/10.0",
      "courses": []
    }
  ],
  "publications": [
    {
      "name": "Automated accurate emotion recognition system using rhythm-specific deep convolutional neural network technique with multi-channel EEG signals. Computers in Biology and Medicine.",
      "publisher": "Daksh Maheshwari, S.K. Ghosh, R.K. Tripathy, Manish Sharma, U. Rajendra Acharya",
      "releaseDate": "2021-07-01",
      "url": "https://doi.org/10.1016/j.compbiomed.2021.104428",
      "summary": ""
    }
  ],
  "teaching experience": [
    {
      "name": "SI-330: Data Manipulation",
      "position": "Graduate Student Instructor",
      "startDate": "2023-08-01",
      "endDate": "2024-05-01"
    }
  ],
  "industry experience": [
    {
      "name": "Oracle",
      "position": "Application Engineer",
      "url": "https://www.oracle.com/",
      "startDate": "2020-09-01",
      "endDate": "2022-07-01",
      "summary": "Spearheaded the design and development of applications for Oracle Fusion SCM Inventory Management products, leveraging Oracle ADF, Oracle JET, and PL/SQL.",
      "highlights": []
    },
    {
      "name": "AFour Technologies",
      "position": "Data Engineering Intern",
      "url": "https://afourtech.com/",
      "startDate": "2020-01-01",
      "endDate": "2020-07-01",
      "summary": "Designed and implemented Metadata Management and Data Governance pipeline with Apache Atlas, enhancing search functionality and improving data accessibility.",
      "highlights": []
    }
  ],
  "projects": [
    {
      "name": "Representation Learning for Medical Images and Reports",
      "summary": "",
      "highlights": [
        "Addressed challenges when dealing with scarcity of medical images, utilizing medical imaging data and reports to learn representations that can be used for downstream tasks.",
        "Developed models which learns a latent representation using transformer based models, 150K+ chest radiographs, and reports from OpenAccess (CXR-8, OpenI) datasets.",
        "Evaluated downstream tasks such as image-text retrieval, classification, and radiology report generation using a single learnt latent representation."
      ],
      "startDate": "2023-08-01",
      "endDate": "2023-12-01",
      "url": "https://example.com"
    },
    {
      "name": "Domain Adaptation & Doman Generalization for Glaucoma Classification",
      "summary": "",
      "highlights": [
        "Investigated impact of domain shift on Supervised and Self-Supervised methods for glaucoma classification, proposing innovative solutions to enhance deep learning model performance amidst domain shift.",
        "Explored self-supervised methods such as Masked Auto-Encoders and SimCLR for domain generalization, engaging in pre-training models and fine-tuning for downstream tasks.",
        "Surpassed state-of-the-art ResNet50 performance by at least 5% in Classification, AttUNet performance in Segmentation, underscoring the potential of Masked Auto-Encoders (MAEs) for domain generalization."
      ],
      "startDate": "2023-05-01",
      "endDate": "2023-07-01",
      "url": "https://example.com"
    },
    {
      "name": "Pushing the limits of Random Consensus Robust PCA",
      "summary": "",
      "highlights": [
        "Addressed challenges in managing large corrupted datasets, enhancing computational performance and memory usage of Random Consensus Robust PCA by 10x and 100x respectively.",
        "Improved R2PCA, by identifying subspace U spanned by the low rank matrix, dividing the data matrix into subsets for individual PCA application.",
        "Demonstrated robust performance in managing numerous outliers, ensuring accurate low-rank subspace projections, its effectiveness with large corrupted datasets and precise recovery of low-rank subspaces."
      ],
      "startDate": "2023-01-01",
      "endDate": "2023-04-01",
      "url": "https://example.com"
    },
    {
      "name": "Study on Implicit Bias in terms of Optimization Geometry",
      "summary": "",
      "highlights": [
        "Delved into the intricacies of implicit bias, investigating its origins, manifestations, and effects within the realm of decision-making processes.",
        "Identified crucial factors that contribute to the formation and persistence of implicit bias, offering valuable insights into the cognitive and social aspects at play."
      ],
      "startDate": "2023-01-01",
      "endDate": "2023-04-01",
      "url": "https://example.com"
    },
    {
      "name": "CARETS: CAncer RElated Terms Search",
      "summary": "",
      "highlights": [
        "Created a robust and user-friendly cancer search engine that serves as a centralized platform for accessing information on cancer, including its types, genomic profiles, symptoms, trials, and treatment options.",
        "Integrated various data sources such as SEERs, Trials.gov, and National Cancer Institute GDC Atlas to ensure a comprehensive and reliable search experience for users.",
        "Implemented using web technologies including Next.js, Flask, and Docker to develop a highly efficient and scalable web application."
      ],
      "startDate": "2023-01-01",
      "endDate": "2023-04-01",
      "url": "https://example.com"
    },
    {
      "name": "MR-based in-vivo Microstructural Imaging",
      "summary": "",
      "highlights": [
        "Implemented deep learning pipelines using novel Multidimensional Mesh 2D Recurrent Networks and Convolutional Neural Networks, and automated workflows for MR-based in-vivo Microstructural Imaging.",
        "Achieved precise estimation of tissue microstructural parameters, including free diffusion coefficient (d0), cell size (V /S), and cell permeability (κ), reducing NRMSE less than 1%.",
        "Conducted comprehensive evaluations of models using simulated, noisy, and clinical data sets, documented insights for future improvements and applications."
      ],
      "startDate": "2022-09-01",
      "endDate": "2023-04-01",
      "url": "https://example.com"
    },
    {
      "name": "Ultrasound, CT, MRI Reconstruction",
      "summary": "",
      "highlights": [
        "Implemented beamforming and scan conversion algorithms in MATLAB for a unique ultrasound system, focusing on detailed analysis, image generation, and comprehensive reporting.",
        "Developed a Bloch equation simulator to study the spin-warp pulse sequence with slice selection, facilitating a comprehensive understanding of magnetization behavior, image acquisition methods, and slice selective excitation in MRI.",
        "Implemented and compared image reconstruction methods (filtered-backprojection and direct Fourier interpolation) in a computed tomography simulation, applying algorithms to various datasets, and conducting detailed analysis of results, artifacts, and inaccuracies."
      ],
      "startDate": "2022-08-01",
      "endDate": "2022-12-01",
      "url": "https://example.com"
    },
    {
      "name": "Discriminating Gait for Different Surfaces",
      "summary": "",
      "highlights": [
        "Conducted an in-depth research study on irregular surfaces using gait data from wearable inertial measurement units (IMUs), enhancing the understanding of human stride on uneven surfaces.",
        "Proposed and implemented a novel methodology, leveraging 1D CNNs and LSTMs to analyze Gyroscopic, Accelerometer, and Magnetometer data, achieving classification accuracy of over 91%.",
        "Provided critical insights into the biomechanics of gait patterns, contributing to the assessment and mitigation of risks associated with falls and injuries on uneven surfaces."
      ],
      "startDate": "2020-01-01",
      "endDate": "2021-01-01",
      "url": "https://example.com"
    },
    {
      "name": "EEG-based Emotion Recognition using Rhythm-Specific Deep CNNs",
      "summary": "",
      "highlights": [
        "Conducted an empirical investigation into the efficacy of multi-channel EEG signals and the Circumplex model of emotions in facilitating the accurate recognition of emotions in human-computer interaction.",
        "Proposed a novel rhythm-specific multi-channel convolutional neural network based approach that leverages the delta, theta, alpha, beta, and gamma rhythms of EEG and uses these rhythms to train a deep CNN for accurate emotion classification tasks.",
        "Validated the proposed model on three publicly available datasets (DEAP, DREAMER, and DASPS) with an average accuracy of 95%+ across all datasets."
      ],
      "startDate": "2018-01-01",
      "endDate": "2020-01-01",
      "url": "https://example.com"
    }
  ],
  "skills": [
    {
      "name": "Programming Languages",
      "level": "",
      "icon": "fa-solid fa-hashtag",
      "keywords": ["Python", "C++", "Rust", "MATLAB", "PL/SQL", "Java", "Julia"]
    },
    {
      "name": "Machine Learning Frameworks",
      "level": "",
      "icon": "fa-solid fa-hashtag",
      "keywords": ["PyTorch", "Tensorflow", "JAX", "TinyGrad"]
    },
    {
      "name": "Software Developement Frameworks",
      "level": "",
      "icon": "fa-solid fa-hashtag",
      "keywords": ["Flask", "FastAPI", "Django", "Oracle ADF", "Oracle JET", "Next.js"]
    }
  ]
}